const hashData: any = [
  {
    title: "五张牛牛",
    key: "TYEHKEnHSGKUw4bNmpbepHKqGJoxVsKKKK",
    children: [
      {
        title: "金额限制",
        children: [
          "USDT转账数量只支持 10 - 20000 USDT，投注金额是转账金额的十分之一。",
          "TRX转账数量只支持 100 - 200000 TRX，投注金额是转账金额的十分之一。",
          "转账低于最低转账金额时，视为无效投注，不进行返奖，不给予退回。",
          "转账高于上限转账金额时，视为无效投注，不参与抽奖，扣除千分之一手续费后退还本金。",
          "仅支持整数币参与抽奖，小数部分将自动忽略。"
        ]
      },
      {
        title: "游戏规则",
        children: [
          {
            title: "游戏规则",
            children: [
              '获取您转账的区块哈希值Block Hash含英文字母之最后 9 位数为开奖结果，後9位数第1-5位数为"庄家"牌面，後9位数第5-9位数为"闲家"牌面。'
            ]
          },
          {
            title: "牌型说明",
            children: [
              "有牛: 5位数内任3位数总和为 10 的倍数，视为有牛，其余2位数加总之个位数为1-9称为牛一至牛九，为0则称为牛牛",
              "没牛: 5位数内任3位数相加无法得出 10 的倍数，视为没牛",
              "所有英文字母皆计算为10"
            ]
          },
          {
            title: "比较大小",
            children: [
              "牌型大小顺序: 牛牛 > 牛九 > 牛八 > 牛七 > 牛六 > 牛五 > 牛四 > 牛三 > 牛二 > 牛一 > 沒牛",
              "闲庄同为没牛状态下，只比5位数内最大值，大小顺序: a > b > c > d > e > f > 0 > 9 > 8 > 7 > 6 > 5 > 4 > 3 > 2 > 1"
            ]
          },
          {
            title: "中奖规则",
            children: [
              "庄家赢: 转账金额-(庄家倍数x转账金额x10%), 剩余金额返还闲家",
              "闲家赢: 转账金额+(闲家倍数x转账金额x10%)-(闲家倍数x转账金额x10%x5%)",
              "倍数意为牛一至牛牛之个位数字，例: 牛牛为10倍, 牛五为5倍",
              "闲庄同为牛六至牛牛: 同点全额退款",
              "闲庄同为牛一至牛五: 同点视庄家赢",
              "闲庄同为没牛: 取5位数内最大值比较大小，若同字母庄赢一倍，无字母同数字全额退款",
              "庄赢一倍: 转账金额-(转账金额x10%), 剩余金额返还闲家"
            ]
          }
        ]
      },
      {
        title: "中奖实例",
        children: [
          {
            title: "有牛：您的转账金额为: 18000",
            children: [
              "该笔转账的区块哈希为: 000*****c7db9e5f5",
              "庄家开奖号码: c7db9. c+d+b=30, 7+9=16, 为牛六",
              "闲家开奖号码: 9e5f5. e+5+5=20, 9+f=19, 为牛九",
              "开奖结果: 牛九 > 牛六, 闲家赢",
              "系统回款金额为: (18000)+(9x18000x10%)-(9x18000x10%x5%)=33390"
            ]
          },
          {
            title: "有牛同点(牛一至牛五)：您的转账金额为：3000",
            children: [
              "该笔转账的区块哈希为: 000*****c2d2eb6f8",
              "庄家开奖号码: c2d2e. c+d+e=30, 2+2=4, 为牛四",
              "闲家开奖号码: eb6f8. e+b+f=30, 6+8=14, 为牛四",
              "开奖结果: 同为牛四, 庄家赢",
              "系统回款金额为: (3000)-(4x3000x10%)=1800"
            ]
          },
          {
            title: "有牛同点(牛六至牛牛)：您的转账金额为：12000",
            children: [
              "该笔转账的区块哈希为: 000*****cba827c38",
              "庄家开奖号码: cba82. c+b+a=30, 8+2=10, 为牛牛",
              "闲家开奖号码: 27c38. 2+c+8=20, 7+3=10, 为牛",
              "开奖结果: 同为牛牛, 全额退款",
              "系统回款金额为: 12000"
            ]
          },
          {
            title: "没牛有字母：您的转账金额为：2000",
            children: [
              "该笔转账的区块哈希为: 000*****b4c95e4f8",
              "庄家开奖号码: b4c95. 任意三位数相加无法得出10的倍数, 为没牛. 取最大值b",
              "闲家开奖号码: 5e4f8. 任意三位数相加无法得出10的倍数, 为没牛. 取最大值e",
              "开奖结果: b > e, 庄赢一倍",
              "系统回款金额为: (2000)-(2000x10%)=1800"
            ]
          },
          {
            title: "没牛无字母：您的转账金额为：10000",
            children: [
              "该笔转账的区块哈希为: 000*****286547502",
              "庄家开奖号码: 28654. 任意三位数相加无法得出10的倍数, 为没牛. 取最大值8",
              "闲家开奖号码: 47502. 任意三位数相加无法得出10的倍数, 为没牛. 取最大值0",
              "开奖结果: 0 > 8, 闲赢一倍",
              "系统回款金额为: (10000)+(10000x10%)=11000"
            ]
          },
          {
            title: "没牛无字母同点：您的转账金额为：9000",
            children: [
              "该笔转账的区块哈希为: 000*****685248256",
              "庄家开奖号码: 68524. 任意三位数相加无法得出10的倍数, 为没牛. 取最大值8",
              "闲家开奖号码：48256. 任意三位数相加无法得出10的倍数, 为没牛. 取最大值8",
              "开奖结果: 同为8, 全额退款",
              "系统回款金额为: 9000"
            ]
          }
        ]
      }
    ]
  },
  {
    title: "单双竞彩",
    key: "TEuy2aksGsdVDDnVp1d3vTR18hr72EQQQQ",
    children: [
      {
        title: "金额限制",
        children: [
          "投注限额 10 - 20000 USDT。",
          "投注限额 100 - 200000 TRX。",
          "仅支持【去中心化钱包】向官方投注地址转账投注，若使用交 易所钱包投注则无效，也无法追回；",
          "获取您当笔转账的区块哈希值（Block hash）作为中奖判定依据；",
          "低于最低投注金额,视为无效金额,平台不给予返还",
          "高于最高限额的投注。视为无效金额,平台抽取0.1%手续费，给予返还",
          "仅支持整数币参与抽奖，小数部分将自动忽略"
        ]
      },
      {
        title: "游戏规则",
        children: [
          "转账金额的个位数和区块哈希值（Block hash）最后的数字（只看数字、不看字母）同为单数或同为双数时，则投注中奖；",
          "1、3、5、7、9 为单数；",
          "0、2、4、6、8 为双数；",
          "中奖后系统10秒内自动结算转账金额1.95倍的同类数字币（USDT或TRX）到您的【去中心化钱包】，无需手动提交申请，自动派奖到账."
        ]
      },
      {
        title: "中奖实例",
        children: [
          {
            title: "转账金额为 ： 1001",
            children: [
              "识别为押单",
              "该笔转账的区块哈希为：000*****e3a",
              '区块哈希值最后一位数字为"3"识别为单',
              "结果中奖系统汇款金额为：1001*1.95=1,951.95"
            ]
          },
          {
            title: "转账金额为 ： 152.23",
            children: [
              "识别为押双",
              "该笔转账的区块哈希为：000*****2ba",
              '区块哈希值最后一位数字为"2"识别为双',
              "结果中奖系统汇款金额为：152*1.95=296.4"
            ]
          },
          {
            title: "转账金额为 ： 2308",
            children: [
              "识别为押双",
              "该笔转账的区块哈希为：000*****a13",
              '区块哈希值最后一位数字为"3"识别为单',
              "结果未中奖不返还数字币"
            ]
          },
          {
            title: "转账金额为 ： 893",
            children: [
              "识别为押单",
              "该笔转账的区块哈希为：000*****cb4",
              '区块哈希值最后一位数字为"4"识别为双',
              "结果未中奖不返还数字币"
            ]
          }
        ]
      }
    ]
  }
];

export default hashData;
