const hashData: any = [
  {
    title: "单双竞彩",
    key: "TEuy2aksGsdVDDnVp1d3vTR18hr72EQQQQ",
    children: [
      {
        title: "金额限制",
        children: [
          "投注限额 10 - 2000 USDT。",
          "投注限额 100 - 20000 TRX。",
          "仅支持【去中心化钱包】向官方投注地址转账投注，若使用交 易所钱包投注则无效，也无法追回；",
          "获取您当笔转账的区块哈希值（Block hash）作为中奖判定依据；",
          "低于最低投注金额,视为无效金额,平台不给予返还",
          "高于最高限额的投注。视为无效金额,平台抽取手续费，请联系客服给予返还",
          "仅支持整数币参与抽奖，小数部分将自动忽略"
        ]
      },
      {
        title: "游戏规则",
        children: [
          "转账金额的个位数和区块哈希值（Block hash）最后的数字（只看数字、不看字母）同为单数或同为双数时，则投注中奖；",
          "1、3、5、7、9 为单数；",
          "0、2、4、6、8 为双数；",
          "中奖后系统10秒内自动结算转账金额1.95倍的同类数字币（USDT或TRX）到您的【去中心化钱包】，无需手动提交申请，自动派奖到账."
        ]
      },
      {
        title: "中奖实例",
        children: [
          {
            title: "转账金额为 ： 1001",
            children: [
              "识别为押单",
              "该笔转账的区块哈希为：000*****e3a",
              '区块哈希值最后一位数字为"3"识别为单',
              "结果中奖系统汇款金额为：1001*1.95=1,951.95"
            ]
          },
          {
            title: "转账金额为 ： 152.23",
            children: [
              "识别为押双",
              "该笔转账的区块哈希为：000*****2ba",
              '区块哈希值最后一位数字为"2"识别为双',
              "结果中奖系统汇款金额为：152*1.95=296.4"
            ]
          },
          {
            title: "转账金额为 ： 2308",
            children: [
              "识别为押双",
              "该笔转账的区块哈希为：000*****a13",
              '区块哈希值最后一位数字为"3"识别为单',
              "结果未中奖不返还数字币"
            ]
          },
          {
            title: "转账金额为 ： 893",
            children: [
              "识别为押单",
              "该笔转账的区块哈希为：000*****cb4",
              '区块哈希值最后一位数字为"4"识别为双',
              "结果未中奖不返还数字币"
            ]
          }
        ]
      }
    ]
  },
  {
    title: "庄闲竞彩",
    key: "TYEHKEnHSGKUw4bNmpbepHKqGJoxVsKKKK",
    children: [
      {
        title: "金额限制",
        children: [
          "USDT转账数量只支持 10 - 2000 USDT，投注金额是转账金额的十分之一。",
          "TRX转账数量只支持 100 - 20000 TRX，投注金额是转账金额的十分之一。",
          "转账低于最低转账金额时，视为无效投注，不进行返奖，不给予退回。",
          "转账高于上限转账金额时，视为无效投注，不参与抽奖，扣除手续费后退还本金。",
          "仅支持整数币参与抽奖，小数部分将自动忽略。"
        ]
      },
      {
        title: "游戏规则",
        children: [
          {
            title: "游戏规则",
            children: [
              '区块哈希值（Block hash）最后五位字符作为开奖结果，倒数第五位与倒数第四位相加作为【庄】的点数；倒数第二位与倒数第一位相加作为【闲】的点数；您可选择押注【庄】、【闲】或【和】；比较点数时，0点最小、9点最大、字母识别为0；',
              '举例Block hash为 000******b84a9',
              'b+8作为【庄】点数8点；',
              'A+9作为【闲】点数9点，本局【闲】赢；',
              '根据转账投注金额的个位数判定下注类型',
              '下注101USDT时，个位数为1识别为押注【庄】赢；',
              '下注102USDT时，个位数为2识别为押注【闲】赢；',
              '下注103USDT时，个位数为3识别为押注【和】赢；',
              '赔率',
              '押注庄赢，比较点数后，庄赢赔2倍；',
              '押注闲赢，比较点数后，闲赢赔2倍；',
              '押注和赢，比较点数后，和赢赔8.0倍；',
              '中奖后系统10秒内自动结算转账金额2倍或8倍的同类数字币（USDT或TRX）到您的【去中心化钱包】，无需手动提交申请，自动派奖到账.'
            ]
          }
        ]
      },
      {
        title: "中奖实例",
        children: [
          {
            title: "转账金额为 ： 1001",
            children: [
              "识别为押庄赢",
              "该笔转账的区块哈希为：000*****a7B41",
              'a、7代表 庄的点数为"7"点',
              '4、1代表 闲的点数为"5"点',
              "开奖为庄赢",
              '结果中奖系统汇款金额为：',
              '1001*2=2002'
            ]
          },
          {
            title: "转账金额为 ： 3223",
            children: [
              "识别为押和赢",
              "该笔转账的区块哈希为：000*****a7B43",
              'a、7代表 庄的点数为"7"点',
              '4、3代表 闲的点数为"7"点',
              "开奖为押和赢",
              "结果中奖系统汇款金额为：3223*8=25,784"
            ]
          },
          {
            title: "转账金额为 ： 1002.23",
            children: [
              "识别为押闲赢",
              "该笔转账的区块哈希为：000*****a7B43",
              'a、7代表 庄的点数为"7"点',
              '4、3代表 闲的点数为"7"点',
              '开奖为押和赢',
              "判定玩家未中奖"
            ]
          },
          {
            title: "转账金额为 ： 2004",
            children: [
              "识别为无效押注",
              "个位数为4，识别为无效投注",
              '扣除手续费后原路退回，请联系客服'
            ]
          }
        ]
      }
    ]
  }
];

export default hashData;
